# **Handle Duplicate Data**

In [30]:
import pandas as pd

In [31]:
data = {'Name':['a','b','c','d','a','c'],"english":[8,7,5,8,8,4],'math':[2,3,4,5,2,6]}

In [32]:
df = pd.DataFrame(data)
df

  Name  english  math
0    a        8     2
1    b        7     3
2    c        5     4
3    d        8     5
4    a        8     2
5    c        4     6

In [33]:
df.duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
dtype: bool

In [36]:
#Remove diplicate
df.drop_duplicates(inplace=True)
df

  Name  english  math
0    a        8     2
1    b        7     3
2    c        5     4
3    d        8     5
5    c        4     6